#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	Сообщить("1");
	Если СтрДлина(Наименование) < 10 Тогда
		Сообщить("Короткое наименование!");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("Реквизит1"));	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	ЗаписьЖурналаРегистрации("Справочник1.ЗаписьЭлемента", УровеньЖурналаРегистрации.Информация, , ,
        "ОК");		
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Наименование = ВРег(Наименование);
КонецПроцедуры

#КонецОбласти
